In [1]:
import pandas as pd

In [47]:
data = pd.read_csv('sample.csv', header='infer', index_col='Name')
# header: column값을 지정, default는 infer -> 첫번째 행을 column명으로 간주
# index_col: row의 이름이 되는 column 지정

In [70]:
data

          Country   Age   Salary Purchased
Name
James      France  44.0  72000.0        No
Tim         Spain  27.0  48000.0       Yes
Sarah     Germany  30.0  54000.0        No
Robert      Spain  38.0  61000.0        No
Emma      Germany  40.0      NaN       Yes
Jennifer   France  35.0  58000.0       Yes
Linda       Spain   NaN  52000.0        No
Thomas     France  48.0  79000.0       Yes
Ben       Germany  50.0  83000.0        No
Scarlett   France  37.0  67000.0       Yes

In [71]:
data.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [72]:
print(data.values)
print(type(data.values))
# numpy의 loadtxt나 getfromtxt로도 csv 로드 가능

[['France' 44.0 72000.0 'No']
 ['Spain' 27.0 48000.0 'Yes']
 ['Germany' 30.0 54000.0 'No']
 ['Spain' 38.0 61000.0 'No']
 ['Germany' 40.0 nan 'Yes']
 ['France' 35.0 58000.0 'Yes']
 ['Spain' nan 52000.0 'No']
 ['France' 48.0 79000.0 'Yes']
 ['Germany' 50.0 83000.0 'No']
 ['France' 37.0 67000.0 'Yes']]
<class 'numpy.ndarray'>

In [73]:
data.values[:,:2]
# 처음부터 끝까지, 앞에 두 column만(국적, 나이)

array([['France', 44.0],
       ['Spain', 27.0],
       ['Germany', 30.0],
       ['Spain', 38.0],
       ['Germany', 40.0],
       ['France', 35.0],
       ['Spain', nan],
       ['France', 48.0],
       ['Germany', 50.0],
       ['France', 37.0]], dtype=object)

In [52]:
X = data.values[:,:-1]
print(X.shape)
Y = data.values[:,-1]
print(Y.shape)
Y2 = data.values[:,-1:]
print(Y2.shape)

(10, 3)
(10,)
(10, 1)

In [53]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, James to Scarlett
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 400.0+ bytes

In [54]:
data.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [63]:
data.loc['Linda','Salary']

52000.0

In [64]:
data.iloc[6,2]

52000.0

In [66]:
print(data.loc[:'Linda',:])
print(data.iloc[:6,:])

          Country   Age   Salary Purchased
Name
James      France  44.0  72000.0        No
Tim         Spain  27.0  48000.0       Yes
Sarah     Germany  30.0  54000.0        No
Robert      Spain  38.0  61000.0        No
Emma      Germany  40.0      NaN       Yes
Jennifer   France  35.0  58000.0       Yes
Linda       Spain   NaN  52000.0        No
          Country   Age   Salary Purchased
Name
James      France  44.0  72000.0        No
Tim         Spain  27.0  48000.0       Yes
Sarah     Germany  30.0  54000.0        No
Robert      Spain  38.0  61000.0        No
Emma      Germany  40.0      NaN       Yes
Jennifer   France  35.0  58000.0       Yes